[
    {
        "title": "Добро пожаловать!",
        "date": "15.04.2025",
        "content": "Здесь будут все обновления лаунчера."
    },
    {
        "title": "Обновление 1.0.2",
        "date": "20.04.2025",
        "content": "ENG:\n\n1. Improved program optimization. The launcher now consumes fewer system resources.\n\n2. Added Forge and Fabric versions (OptiFine). You can now download and launch these versions directly from the launcher.\n\n3. Added an option to close the launcher when the game starts. You can enable this in the launcher settings.\n\n4. Skin changing feature (still in development). A button has been added to the main menu—clicking it opens a file dialog to select a skin. The feature is not yet complete but will be implemented soon.\n\n5. Completely redesigned interface. The launcher’s interface is now more intuitive and user-friendly, with new tabs, menus, buttons, etc.\n\n6. Random player name generator (in development). A button next to the username field that generates a random in-game name.\n\n7. News section. A new tab has been added to the launcher, displaying news about both the launcher and Minecraft.\n\nEnjoy your game!\n\nRU:\n\n1. Улучшена оптимизация программы. Теперь программа потребляет меньше системных требований и ресурсов.\n\n2. Добавлены Forge и Fabric версии (Optfine). Теперь вы можете загружать эти версии и запускать их прямиком из лаунчера.\n\n3. Добавлена функция закрытия лаунчера при запуске игры. Включить ее можно в настройках лаунчера.\n\n4. Добавлена смена скина (пока что тоже в разработке). В главном меню появилась кнопка, нажав на которую, открывается диалог выбора файла скина. Функция не доделана, но будет реализована в ближайшем будущем.\n\n5. Кардинально измененный интерфейс. Интерфейс программы стал более понятным и удобным. Появились новые вкладки, меню, кнопки и т.д.\n\n6. Функция случайного имени игрока (в разработке). Кнопка, рядом с полем ввода имени пользователя, которая случайным образом генерирует игровое имя.\n\n7. Новости. В лаунчер добавлена новая вкладка с новостями лаунчера и Minecraft.\n\nПриятной игры!"
    }
]
